# Data Frame

In [1]:
!mamba install pandas

mambajs 0.19.13

Specs: xeus-python, numpy, matplotlib, pillow, ipywidgets>=8.1.6, ipyleaflet, scipy, pandas
Channels: emscripten-forge, conda-forge

Solving environment...
Solving took 4.5242999997138975 seconds
  Name                          Version                       Build                         Channel
────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
+ pandas                        3.0.1                         np22py313h9d9dc1e_0           emscripten-forge
+ python-tzdata                 2025.3                        pyhd8ed1ab_0                  conda-forge
- pip                           25.3                          pyh145f28c_0                  conda-forge

In [2]:
import numpy as np
import pandas as pd

## Creating DataFrame

### using list

In [3]:
student_data= [
    [60, 30, 55],
    [77, 45, 67],
    [23, 34, 66],
    [11, 23, 45]
]

pd.DataFrame(student_data, columns=['lab', 'theory', 'quize'])

   lab  theory  quize
0   60      30     55
1   77      45     67
2   23      34     66
3   11      23     45

### using Dict

In [4]:
student_data= {
   'lab': [60, 77, 23, 11],
    'theory':[30, 45, 34, 23],
    'quize':[55, 67, 66, 45]
}

pd.DataFrame(student_data)

   lab  theory  quize
0   60      30     55
1   77      45     67
2   23      34     66
3   11      23     45

### using read csv

In [5]:
virat=pd.read_csv('Virat Kohli DataSet.csv')
virat

,Runs,BF,4s,6s,SR,Pos,Dismissal,Inns,Opposition,Ground,Start Date
0,12,22,1,0,54.54,2.0,lbw,1,v Sri Lanka,Dambulla,18-Aug-08
1,37,67,6,0,55.22,2.0,caught,2,v Sri Lanka,Dambulla,20-Aug-08
2,25,38,4,0,65.78,1.0,run out,1,v Sri Lanka,Colombo (RPS),24-Aug-08
3,54,66,7,0,81.81,1.0,bowled,1,v Sri Lanka,Colombo (RPS),27-Aug-08
4,31,46,3,1,67.39,1.0,lbw,2,v Sri Lanka,Colombo (RPS),29-Aug-08
...,...,...,...,...,...,...,...,...,...,...,...
127,45,51,2,1,88.23,3.0,caught,2,v New Zealand,Ranchi,26-Oct-16
128,65,76,2,1,85.52,3.0,caught,1,v New Zealand,Visakhapatnam,29-Oct-16
129,122,105,8,5,116.19,3.0,caught,2,v England,Pune,15-Jan-17
130,8,5,2,0,160.00,3.0,caught,1,v England,Cuttack,19-Jan-17
131,55,63,8,0,87.30,3.0,caught,2,v England,Kolkata,22-Jan-17

In [6]:
marks=pd.read_csv('Student_Marks.csv')
marks

    number_courses  time_study   Marks
0                3       4.508  19.202
1                4       0.096   7.734
2                4       3.133  13.811
3                6       7.909  53.018
4                8       7.811  55.299
..             ...         ...     ...
95               6       3.561  19.128
96               3       0.301   5.609
97               4       7.163  41.444
98               7       0.309  12.027
99               3       6.335  32.357

[100 rows x 3 columns]

## DataFrame Attributes and Methods

### shape

In [7]:
virat.shape

(132, 11)

In [8]:
marks.shape

(100, 3)

### data type/ dtypes

In [9]:
virat.dtypes

Runs            int64
BF              int64
4s              int64
6s              int64
SR            float64
Pos           float64
Dismissal         str
Inns            int64
Opposition        str
Ground            str
Start Date        str
dtype: object

### index

In [10]:
virat.index

RangeIndex(start=0, stop=132, step=1)

### column

In [11]:
virat.columns

Index(['Runs', 'BF', '4s', '6s', 'SR', 'Pos', 'Dismissal', 'Inns',
       'Opposition', 'Ground', 'Start Date'],
      dtype='str')

### values

In [12]:
virat.values

array([[12, 22, 1, ..., 'v Sri Lanka', 'Dambulla', '18-Aug-08'],
       [37, 67, 6, ..., 'v Sri Lanka', 'Dambulla', '20-Aug-08'],
       [25, 38, 4, ..., 'v Sri Lanka', 'Colombo (RPS)', '24-Aug-08'],
       ...,
       [122, 105, 8, ..., 'v England', 'Pune', '15-Jan-17'],
       [8, 5, 2, ..., 'v England', 'Cuttack', '19-Jan-17'],
       [55, 63, 8, ..., 'v England', 'Kolkata', '22-Jan-17']],
      shape=(132, 11), dtype=object)

### head and tail

In [13]:
virat.head()

,Runs,BF,4s,6s,SR,Pos,Dismissal,Inns,Opposition,Ground,Start Date
0,12,22,1,0,54.54,2.0,lbw,1,v Sri Lanka,Dambulla,18-Aug-08
1,37,67,6,0,55.22,2.0,caught,2,v Sri Lanka,Dambulla,20-Aug-08
2,25,38,4,0,65.78,1.0,run out,1,v Sri Lanka,Colombo (RPS),24-Aug-08
3,54,66,7,0,81.81,1.0,bowled,1,v Sri Lanka,Colombo (RPS),27-Aug-08
4,31,46,3,1,67.39,1.0,lbw,2,v Sri Lanka,Colombo (RPS),29-Aug-08

In [14]:
virat.tail()

,Runs,BF,4s,6s,SR,Pos,Dismissal,Inns,Opposition,Ground,Start Date
127,45,51,2,1,88.23,3.0,caught,2,v New Zealand,Ranchi,26-Oct-16
128,65,76,2,1,85.52,3.0,caught,1,v New Zealand,Visakhapatnam,29-Oct-16
129,122,105,8,5,116.19,3.0,caught,2,v England,Pune,15-Jan-17
130,8,5,2,0,160.00,3.0,caught,1,v England,Cuttack,19-Jan-17
131,55,63,8,0,87.30,3.0,caught,2,v England,Kolkata,22-Jan-17

### sample

In [15]:
virat.sample(5)

,Runs,BF,4s,6s,SR,Pos,Dismissal,Inns,Opposition,Ground,Start Date
99,1,3,0,0,33.33,3.0,not out,2,v England,Birmingham,2-Sep-14
90,31,35,5,0,88.57,3.0,caught,2,v South Africa,Johannesburg,5-Dec-13
60,12,25,0,0,48.00,3.0,caught,2,v Australia,Brisbane,19-Feb-12
23,64,73,8,0,87.67,3.0,caught,2,v New Zealand,Jaipur,1-Dec-10
39,35,49,4,0,71.42,4.0,caught,2,v Sri Lanka,Mumbai,2-Apr-11

### info

In [16]:
virat.info()

<class 'pandas.DataFrame'>
RangeIndex: 132 entries, 0 to 131
Data columns (total 11 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Runs        132 non-null    int64
 1   BF          132 non-null    int64
 2   4s          132 non-null    int64
 3   6s          132 non-null    int64
 4   SR          132 non-null    float64
 5   Pos         132 non-null    float64
 6   Dismissal   132 non-null    str
 7   Inns        132 non-null    int64
 8   Opposition  132 non-null    str
 9   Ground      132 non-null    str
 10  Start Date  132 non-null    str
dtypes: float64(2), int64(5), str(4)
memory usage: 9.4 KB

In [17]:
marks.info()

<class 'pandas.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 3 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   number_courses  100 non-null    int64
 1   time_study      100 non-null    float64
 2   Marks           100 non-null    float64
dtypes: float64(2), int64(1)
memory usage: 2.4 KB

### describe

In [18]:
virat.describe()

,Runs,BF,4s,6s,SR,Pos,Inns
count,132.000000,132.000000,132.000000,132.000000,132.000000,132.000000,132.000000
mean,46.848485,50.871212,4.371212,0.545455,76.991212,3.303030,1.575758
std,41.994635,38.729716,4.404032,1.086795,37.874491,0.873174,0.496110
min,0.000000,0.000000,0.000000,0.000000,0.000000,1.000000,1.000000
25%,10.000000,17.750000,1.000000,0.000000,61.702500,3.000000,1.000000
50%,32.500000,42.500000,3.000000,0.000000,78.710000,3.000000,2.000000
75%,80.250000,82.250000,7.000000,1.000000,100.000000,4.000000,2.000000
max,154.000000,140.000000,18.000000,7.000000,209.090000,7.000000,2.000000

In [19]:
marks.describe()

       number_courses  time_study       Marks
count      100.000000  100.000000  100.000000
mean         5.290000    4.077140   24.417690
std          1.799523    2.372914   14.326199
min          3.000000    0.096000    5.609000
25%          4.000000    2.058500   12.633000
50%          5.000000    4.022000   20.059500
75%          7.000000    6.179250   36.676250
max          8.000000    7.957000   55.299000

### isnull

In [20]:
virat.isnull().sum()

Runs          0
BF            0
4s            0
6s            0
SR            0
Pos           0
Dismissal     0
Inns          0
Opposition    0
Ground        0
Start Date    0
dtype: int64

### duplicated

In [21]:
virat.duplicated()

0      False
1      False
2      False
3      False
4      False
       ...
127    False
128    False
129    False
130    False
131    False
Length: 132, dtype: bool

### rename

In [22]:
 marks.rename(columns={'number_courses': 'total_course', 'time_study':'total_study_time'})

    total_course  total_study_time   Marks
0              3             4.508  19.202
1              4             0.096   7.734
2              4             3.133  13.811
3              6             7.909  53.018
4              8             7.811  55.299
..           ...               ...     ...
95             6             3.561  19.128
96             3             0.301   5.609
97             4             7.163  41.444
98             7             0.309  12.027
99             3             6.335  32.357

[100 rows x 3 columns]

## Pandas Math Methods

### sum

In [23]:
marks.sum()

number_courses     529.000
time_study         407.714
Marks             2441.769
dtype: float64

In [24]:
marks.sum(axis= 1)

0     26.710
1     11.830
2     20.944
3     66.927
4     71.110
       ...
95    28.689
96     8.910
97    52.607
98    19.336
99    41.692
Length: 100, dtype: float64

### mean/ median/ mod

In [25]:
marks.mean()

number_courses     5.29000
time_study         4.07714
Marks             24.41769
dtype: float64

In [26]:
marks.median()

number_courses     5.0000
time_study         4.0220
Marks             20.0595
dtype: float64

In [27]:
marks.mode()

    number_courses  time_study   Marks
0              3.0       0.096   5.609
1              NaN       0.130   6.053
2              NaN       0.140   6.185
3              NaN       0.156   6.217
4              NaN       0.301   6.349
..             ...         ...     ...
95             NaN       7.711  53.018
96             NaN       7.775  53.158
97             NaN       7.811  53.359
98             NaN       7.909  54.321
99             NaN       7.957  55.299

[100 rows x 3 columns]

## selecting columns from a DataFrame

In [28]:
movies= pd.read_csv('BollywoodMovieDetail.csv')
movies

,imdbId,title,releaseYear,releaseDate,genre,writers,actors,directors,sequel,hitFlop
0,tt0118578,Albela,2001,20 Apr 2001,Romance,Honey Irani (screenplay) | Honey Irani (story)...,Govinda | Aishwarya Rai Bachchan | Jackie Shro...,Deepak Sareen,0.0,2
1,tt0169102,Lagaan: Once Upon a Time in India,2001,08 May 2002,Adventure | Drama | Musical,Ashutosh Gowariker (story) | Ashutosh Gowarike...,Aamir Khan | Gracy Singh | Rachel Shelley | Pa...,Ashutosh Gowariker,0.0,6
2,tt0187279,Meri Biwi Ka Jawab Nahin,2004,02 Jul 2004,Action | Comedy,NaN,Akshay Kumar | Sridevi | Gulshan Grover | Laxm...,Pankaj Parashar | S.M. Iqbal,0.0,1
3,tt0222024,Hum Tumhare Hain Sanam,2002,24 May 2002,Drama | Romance,K.S. Adiyaman | Arun Kumar (assistant dialogue...,Shah Rukh Khan | Madhuri Dixit | Salman Khan |...,K.S. Adiyaman,0.0,4
4,tt0227194,One 2 Ka 4,2001,30 Mar 2001,Action | Comedy | Drama,Sanjay Chhel | Raaj Kumar Dahima (screenplay) ...,Shah Rukh Khan | Juhi Chawla | Jackie Shroff |...,Shashilal K. Nair,0.0,1
...,...,...,...,...,...,...,...,...,...,...
1279,tt4121522,Shuruaat Ka Interval,2014,15 Aug 2014,NaN,Aarti S. Bagdi | Amrit Raj Gupta | Krishan Hoo...,Kaivalya Chheda | Rajsekhar Aningi | Avidant B...,Aarti S. Bagdi | Amrit Raj Gupta | Krishan Hoo...,0.0,1
1280,tt4187650,Trip to Bhangarh,2014,28 Aug 2014,Horror,NaN,Manish Choudhary | Suzanna Mukherjee | Poonam ...,Jitendra Pawar,0.0,1
1281,tt4190220,Zed Plus,2014,28 Nov 2014,NaN,Chandra Prakash Dwivedi (screen play and dialo...,Adil Hussain | Ekavali Khanna | Kulbhushan Kha...,Chandra Prakash Dwivedi,0.0,1
1282,tt4219300,Gollu aur Pappu,2014,21 Nov 2014,Comedy,NaN,Vir Das | Sandeepa Dhar | Rahul Handa | Dimple...,Kabir Sadanand,0.0,1
1283,tt4228746,Zid,2014,28 Nov 2014,Thriller,Vivek Agnihotri | Rohit Malhotra,Shradha Das | Mohan Kapoor | Mannara | Karanvi...,Rohit Malhotra | Anubhav Sinha,0.0,2

In [29]:
movies['title']

0                                  Albela
1       Lagaan: Once Upon a Time in India
2                Meri Biwi Ka Jawab Nahin
3                  Hum Tumhare Hain Sanam
4                              One 2 Ka 4
                      ...
1279                 Shuruaat Ka Interval
1280                     Trip to Bhangarh
1281                             Zed Plus
1282                      Gollu aur Pappu
1283                                  Zid
Name: title, Length: 1284, dtype: str

In [30]:
movies[['title', 'writers', 'actors']]

,title,writers,actors
0,Albela,Honey Irani (screenplay) | Honey Irani (story)...,Govinda | Aishwarya Rai Bachchan | Jackie Shro...
1,Lagaan: Once Upon a Time in India,Ashutosh Gowariker (story) | Ashutosh Gowarike...,Aamir Khan | Gracy Singh | Rachel Shelley | Pa...
2,Meri Biwi Ka Jawab Nahin,NaN,Akshay Kumar | Sridevi | Gulshan Grover | Laxm...
3,Hum Tumhare Hain Sanam,K.S. Adiyaman | Arun Kumar (assistant dialogue...,Shah Rukh Khan | Madhuri Dixit | Salman Khan |...
4,One 2 Ka 4,Sanjay Chhel | Raaj Kumar Dahima (screenplay) ...,Shah Rukh Khan | Juhi Chawla | Jackie Shroff |...
...,...,...,...
1279,Shuruaat Ka Interval,Aarti S. Bagdi | Amrit Raj Gupta | Krishan Hoo...,Kaivalya Chheda | Rajsekhar Aningi | Avidant B...
1280,Trip to Bhangarh,NaN,Manish Choudhary | Suzanna Mukherjee | Poonam ...
1281,Zed Plus,Chandra Prakash Dwivedi (screen play and dialo...,Adil Hussain | Ekavali Khanna | Kulbhushan Kha...
1282,Gollu aur Pappu,NaN,Vir Das | Sandeepa Dhar | Rahul Handa | Dimple...
1283,Zid,Vivek Agnihotri | Rohit Malhotra,Shradha Das | Mohan Kapoor | Mannara | Karanvi...

## selecting rows from a DataFrame

### using iloc

In [31]:
movies.iloc[1]

imdbId                                                 tt0169102
title                          Lagaan: Once Upon a Time in India
releaseYear                                                 2001
releaseDate                                          08 May 2002
genre                                Adventure | Drama | Musical
writers        Ashutosh Gowariker (story) | Ashutosh Gowarike...
actors         Aamir Khan | Gracy Singh | Rachel Shelley | Pa...
directors                                     Ashutosh Gowariker
sequel                                                       0.0
hitFlop                                                        6
Name: 1, dtype: object

In [32]:
movies.iloc[1:5]

,imdbId,title,releaseYear,releaseDate,genre,writers,actors,directors,sequel,hitFlop
1,tt0169102,Lagaan: Once Upon a Time in India,2001,08 May 2002,Adventure | Drama | Musical,Ashutosh Gowariker (story) | Ashutosh Gowarike...,Aamir Khan | Gracy Singh | Rachel Shelley | Pa...,Ashutosh Gowariker,0.0,6
2,tt0187279,Meri Biwi Ka Jawab Nahin,2004,02 Jul 2004,Action | Comedy,NaN,Akshay Kumar | Sridevi | Gulshan Grover | Laxm...,Pankaj Parashar | S.M. Iqbal,0.0,1
3,tt0222024,Hum Tumhare Hain Sanam,2002,24 May 2002,Drama | Romance,K.S. Adiyaman | Arun Kumar (assistant dialogue...,Shah Rukh Khan | Madhuri Dixit | Salman Khan |...,K.S. Adiyaman,0.0,4
4,tt0227194,One 2 Ka 4,2001,30 Mar 2001,Action | Comedy | Drama,Sanjay Chhel | Raaj Kumar Dahima (screenplay) ...,Shah Rukh Khan | Juhi Chawla | Jackie Shroff |...,Shashilal K. Nair,0.0,1

In [33]:
movies.iloc[[1, 4, 11]]

,imdbId,title,releaseYear,releaseDate,genre,writers,actors,directors,sequel,hitFlop
1,tt0169102,Lagaan: Once Upon a Time in India,2001,08 May 2002,Adventure | Drama | Musical,Ashutosh Gowariker (story) | Ashutosh Gowarike...,Aamir Khan | Gracy Singh | Rachel Shelley | Pa...,Ashutosh Gowariker,0.0,6
4,tt0227194,One 2 Ka 4,2001,30 Mar 2001,Action | Comedy | Drama,Sanjay Chhel | Raaj Kumar Dahima (screenplay) ...,Shah Rukh Khan | Juhi Chawla | Jackie Shroff |...,Shashilal K. Nair,0.0,1
11,tt0256692,Chori Chori Chupke Chupke,2001,09 Mar 2001,Drama | Musical | Romance,Shyam Goel (screenplay) | Javed Siddiqui (dial...,Preity Zinta | Salman Khan | Rani Mukerji | Am...,Abbas Alibhai Burmawalla | Mastan Alibhai Burm...,0.0,5

### using loc

In [34]:
movies.columns

Index(['imdbId', 'title', 'releaseYear', 'releaseDate', 'genre', 'writers',
       'actors', 'directors', 'sequel', 'hitFlop'],
      dtype='str')

In [35]:
movies = movies.set_index("imdbId")

## Selecting both rows and colomns

In [36]:
marks

    number_courses  time_study   Marks
0                3       4.508  19.202
1                4       0.096   7.734
2                4       3.133  13.811
3                6       7.909  53.018
4                8       7.811  55.299
..             ...         ...     ...
95               6       3.561  19.128
96               3       0.301   5.609
97               4       7.163  41.444
98               7       0.309  12.027
99               3       6.335  32.357

[100 rows x 3 columns]

In [37]:
marks.index

RangeIndex(start=0, stop=100, step=1)

In [38]:
marks.loc[:, 'number_courses']

0     3
1     4
2     4
3     6
4     8
     ..
95    6
96    3
97    4
98    7
99    3
Name: number_courses, Length: 100, dtype: int64

In [39]:
marks.iloc[1:3, 1:3]

   time_study   Marks
1       0.096   7.734
2       3.133  13.811

In [40]:
movies.iloc[0:3, 0:3]

                                       title  releaseYear  releaseDate
imdbId
tt0118578                             Albela         2001  20 Apr 2001
tt0169102  Lagaan: Once Upon a Time in India         2001  08 May 2002
tt0187279           Meri Biwi Ka Jawab Nahin         2004  02 Jul 2004

## Filtering DataFrame

In [41]:
virat

,Runs,BF,4s,6s,SR,Pos,Dismissal,Inns,Opposition,Ground,Start Date
0,12,22,1,0,54.54,2.0,lbw,1,v Sri Lanka,Dambulla,18-Aug-08
1,37,67,6,0,55.22,2.0,caught,2,v Sri Lanka,Dambulla,20-Aug-08
2,25,38,4,0,65.78,1.0,run out,1,v Sri Lanka,Colombo (RPS),24-Aug-08
3,54,66,7,0,81.81,1.0,bowled,1,v Sri Lanka,Colombo (RPS),27-Aug-08
4,31,46,3,1,67.39,1.0,lbw,2,v Sri Lanka,Colombo (RPS),29-Aug-08
...,...,...,...,...,...,...,...,...,...,...,...
127,45,51,2,1,88.23,3.0,caught,2,v New Zealand,Ranchi,26-Oct-16
128,65,76,2,1,85.52,3.0,caught,1,v New Zealand,Visakhapatnam,29-Oct-16
129,122,105,8,5,116.19,3.0,caught,2,v England,Pune,15-Jan-17
130,8,5,2,0,160.00,3.0,caught,1,v England,Cuttack,19-Jan-17
131,55,63,8,0,87.30,3.0,caught,2,v England,Kolkata,22-Jan-17

In [42]:
virat['Ground']=='Dambulla'

0       True
1       True
2      False
3      False
4      False
       ...
127    False
128    False
129    False
130    False
131    False
Name: Ground, Length: 132, dtype: bool

In [43]:
mask= virat['Ground']=='Dambulla'
new_Frame= virat[mask]
new_Frame[['Runs', 'Opposition', 'Ground']]

    Runs   Opposition    Ground
0     12  v Sri Lanka  Dambulla
1     37  v Sri Lanka  Dambulla
17    10  v Sri Lanka  Dambulla
18    28  v Sri Lanka  Dambulla
19     0  v Sri Lanka  Dambulla
20    37  v Sri Lanka  Dambulla

In [44]:
movies

,title,releaseYear,releaseDate,genre,writers,actors,directors,sequel,hitFlop
imdbId,,,,,,,,,
tt0118578,Albela,2001,20 Apr 2001,Romance,Honey Irani (screenplay) | Honey Irani (story)...,Govinda | Aishwarya Rai Bachchan | Jackie Shro...,Deepak Sareen,0.0,2
tt0169102,Lagaan: Once Upon a Time in India,2001,08 May 2002,Adventure | Drama | Musical,Ashutosh Gowariker (story) | Ashutosh Gowarike...,Aamir Khan | Gracy Singh | Rachel Shelley | Pa...,Ashutosh Gowariker,0.0,6
tt0187279,Meri Biwi Ka Jawab Nahin,2004,02 Jul 2004,Action | Comedy,NaN,Akshay Kumar | Sridevi | Gulshan Grover | Laxm...,Pankaj Parashar | S.M. Iqbal,0.0,1
tt0222024,Hum Tumhare Hain Sanam,2002,24 May 2002,Drama | Romance,K.S. Adiyaman | Arun Kumar (assistant dialogue...,Shah Rukh Khan | Madhuri Dixit | Salman Khan |...,K.S. Adiyaman,0.0,4
tt0227194,One 2 Ka 4,2001,30 Mar 2001,Action | Comedy | Drama,Sanjay Chhel | Raaj Kumar Dahima (screenplay) ...,Shah Rukh Khan | Juhi Chawla | Jackie Shroff |...,Shashilal K. Nair,0.0,1
...,...,...,...,...,...,...,...,...,...
tt4121522,Shuruaat Ka Interval,2014,15 Aug 2014,NaN,Aarti S. Bagdi | Amrit Raj Gupta | Krishan Hoo...,Kaivalya Chheda | Rajsekhar Aningi | Avidant B...,Aarti S. Bagdi | Amrit Raj Gupta | Krishan Hoo...,0.0,1
tt4187650,Trip to Bhangarh,2014,28 Aug 2014,Horror,NaN,Manish Choudhary | Suzanna Mukherjee | Poonam ...,Jitendra Pawar,0.0,1
tt4190220,Zed Plus,2014,28 Nov 2014,NaN,Chandra Prakash Dwivedi (screen play and dialo...,Adil Hussain | Ekavali Khanna | Kulbhushan Kha...,Chandra Prakash Dwivedi,0.0,1
tt4219300,Gollu aur Pappu,2014,21 Nov 2014,Comedy,NaN,Vir Das | Sandeepa Dhar | Rahul Handa | Dimple...,Kabir Sadanand,0.0,1
tt4228746,Zid,2014,28 Nov 2014,Thriller,Vivek Agnihotri | Rohit Malhotra,Shradha Das | Mohan Kapoor | Mannara | Karanvi...,Rohit Malhotra | Anubhav Sinha,0.0,2

In [61]:
mov = movies['genre'].str.contains('Action')
movies[mov]

,title,releaseYear,releaseDate,genre,writers,actors,directors,sequel,hitFlop
imdbId,,,,,,,,,
tt0187279,Meri Biwi Ka Jawab Nahin,2004,02 Jul 2004,Action | Comedy,NaN,Akshay Kumar | Sridevi | Gulshan Grover | Laxm...,Pankaj Parashar | S.M. Iqbal,0.0,1
tt0227194,One 2 Ka 4,2001,30 Mar 2001,Action | Comedy | Drama,Sanjay Chhel | Raaj Kumar Dahima (screenplay) ...,Shah Rukh Khan | Juhi Chawla | Jackie Shroff |...,Shashilal K. Nair,0.0,1
tt0247911,Aap Mujhe Achche Lagne Lage,2002,19 Apr 2002,Action | Drama | Romance,Robin Bhatt (story) | Girish Dhamija (dialogue...,Hrithik Roshan | Ameesha Patel | Kiran Kumar |...,Vikram Bhatt,0.0,2
tt0265452,Officer,2001,14 Mar 2001,Action | Crime | Drama,Naeem Sha (dialogue) | Naeem Sha (screenplay) ...,Sunil Shetty | Raveena Tandon | Danny Denzongp...,Naeem Sha,0.0,2
tt0272607,Farz,2001,12 Jan 2001,Action,NaN,Sunny Deol | Preity Zinta | Jackie Shroff | Om...,Raj Kanwar,0.0,4
...,...,...,...,...,...,...,...,...,...
tt3539966,Dishkiyaoon,2014,28 Mar 2014,Action | Thriller,Sanamjit Singh Talwar,Harman Baweja | Harsh Chhaya | Sunny Deol | Ra...,Sanamjit Singh Talwar,0.0,1
tt3617048,Angry Young Man,2014,11 Apr 2014,Action,NaN,Ajay Sinh Rathod | Prachi Sinha,Ramesh Rout,0.0,1
tt3640942,Koyelaanchal,2014,09 May 2014,Action | Drama,Vishal Vijay Kumar | Sanjay Masoom,Kannan Arunachalam | Vinod Khanna | Roopali Kr...,Ashu Trikha,0.0,1
tt3877652,Desi Kattey,2014,12 Sep 2014,Action,Aaryaan Saxena (screenplay),Rajesh Bakshi | Jay Bhanushali | Claudia Ciesl...,Anand Kumar,0.0,1
tt3893476,Spark,2014,10 Oct 2014,Action,V.K. Singh (story),Rati Agnihotri | Mansha Bahl | Rajneesh Duggal...,V.K. Singh,0.0,1

## Add new columns

In [62]:
marks

    number_courses  time_study   Marks
0                3       4.508  19.202
1                4       0.096   7.734
2                4       3.133  13.811
3                6       7.909  53.018
4                8       7.811  55.299
..             ...         ...     ...
95               6       3.561  19.128
96               3       0.301   5.609
97               4       7.163  41.444
98               7       0.309  12.027
99               3       6.335  32.357

[100 rows x 3 columns]

In [65]:
marks['pass_courses']= '3'
marks.head()

   number_courses  time_study   Marks pass_courses
0               3       4.508  19.202            3
1               4       0.096   7.734            3
2               4       3.133  13.811            3
3               6       7.909  53.018            3
4               8       7.811  55.299            3

In [69]:
movies['actors'].str.split('|').apply(lambda x: x[0] if isinstance(x, list) and len(x) > 0 else None)

imdbId
tt0118578             Govinda
tt0169102          Aamir Khan
tt0187279        Akshay Kumar
tt0222024      Shah Rukh Khan
tt0227194      Shah Rukh Khan
                   ...
tt4121522     Kaivalya Chheda
tt4187650    Manish Choudhary
tt4190220        Adil Hussain
tt4219300             Vir Das
tt4228746         Shradha Das
Name: actors, Length: 1284, dtype: str